<!-- add-pr-comment:lambda-api_plan -->

# production/lambda-api Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date = "2025-11-19T16:05:24Z" -> (known after apply)
      ~ id           = "eogfjc" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "redeployment" = "a569c373f208beb1f88ab49ac5930a0a894a2481" -> "2f04d0c6cdb7cc04d50679d03a06c290d45bda16"
        }
        # (3 unchanged attributes hidden)
    }
  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "eogfjc" -> (known after apply)
        id                    = "ags-71oj6jax35-v1"
        tags                  = {}
        # (15 unchanged attributes hidden)
        # (1 unchanged block hidden)
    }
  # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
-/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
      ~ id       = "1285985608704144721" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-01-06T15:18:54Z" -> (known after apply)
        }
    }
Plan: 2 to add, 1 to change, 2 to destroy.

# --- End of Plan 1 ---

```